export const q29_30 = [
    {
        "category": "නිරත වන්නේ ප්‍රධාන කාර්යයක පමණි",
        "appoint": []
    },
    {

        "category": "ප්‍රාථමික අංශය",
        "appoint": [
            {
                "name": "ප්‍රාථමික අංශය",
                "subjects": [
                    {
                        "name": "ප්‍රාථමික පොදු"
                    },
                    {
                        "name": "ප්‍රාථමික ඉංග්‍රීසි"
                    },
                    {
                        "name": "ප්‍රාථමික සෞන්දර්යය"
                    },
                    {
                        "name": "ප්‍රාථමික වෙනත් විෂයයක්"
                    }
                ]
            }
        ]
    },

    {
        "category": "ද්විතීයික (6-11) අංශය",
        "appoint": [
            {
                "name": "ආගමික විෂයයන්",
                "subjects": [

                    {
                        "name": "බුද්ධ ධර්මය"
                    },
                    {
                        "name": "හින්දු ධර්මය / ශෛවනාරි"
                    },
                    {
                        "name": "කතෝලික ධර්මය"
                    },
                    {
                        "name": "ක්‍රිස්තියානි ධර්මය"
                    },
                    {
                        "name": "ඉස්ලාම්"
                    }
                ]
            },
            {
                "name": "අනෙකුත් හර විෂයයන්",
                "subjects": [

                    {
                        "name": "සිංහල භාෂාව හා සාහිත්‍යය"
                    },
                    {
                        "name": "දෙමළ භාෂාව හා සාහිත්‍යය"
                    },
                    {
                        "name": "ඉංග්‍රීසි භාෂාව"
                    },
                    {
                        "name": "ගණිතය"
                    },
                    {
                        "name": "ඉතිහාසය"
                    },
                    {
                        "name": "විද්‍යාව"
                    },
                    {
                        "name": "විද්‍යා / ගණිත"
                    }
                ]
            },
            {
                "name": "සෞන්දර්යය විෂයයන්",
                "subjects": [

                    {
                        "name": "සංගීතය (පෙර දිග)"
                    },
                    {
                        "name": "සංගීතය (බටහිර)"
                    },
                    {
                        "name": "කරණාට සංගීතය"
                    },
                    {
                        "name": "චිත්‍ර"
                    },
                    {
                        "name": "නැටුම්(දේශීය)"
                    },
                    {
                        "name": "භාරත නැටුම්"
                    },
                    {
                        "name": "නාට්‍ය හා රංග කලාව"
                    }
                ]
            },
            {
                "name": "භාෂා විෂයයන්",
                "subjects": [

                    {
                        "name": "පාලි"
                    },
                    {
                        "name": "සංස්කෘත"
                    },
                    {
                        "name": "ප්‍රංශ"
                    },
                    {
                        "name": "ජර්මන්"
                    },
                    {
                        "name": "හින්දි"
                    },
                    {
                        "name": "ජපන්"
                    },
                    {
                        "name": "අරාබි"
                    },
                    {
                        "name": "කොරියන්"
                    },
                    {
                        "name": "චීන"
                    },
                    {
                        "name": "රුසියන්"
                    }
                ]
            },
            {
                "name": "1 වන කාණ්ඩයේ වෙනත් විෂයයන්",
                "subjects": [

                    {
                        "name": "සමාජ විද්‍යාව"
                    },
                    {
                        "name": "ප්‍රායෝගික තාක්ෂණ කුසලතා (ප්‍රා.තා.කු)"
                    },
                    {
                        "name": "සමාජ අධ්‍යයනය"
                    },
                    {
                        "name": "ව්‍යාපාර හා ගිණුම්කරණ අධ්‍යයනය"
                    },
                    {
                        "name": "භූගෝල විද්‍යාව"
                    },
                    {
                        "name": "පුරවැසි අධ්‍යාපනය"
                    },
                    {
                        "name": "ව්‍යවසායකත්ව අධ්‍යයනය"
                    },
                    {
                        "name": "දෙවන භාෂාව (සිංහල)"
                    },
                    {
                        "name": "දෙවන භාෂාව (දෙමළ)"
                    }
                ]
            },
            {
                "name": "2 වන කාණ්ඩයේ වෙනත් විෂයයන්",
                "subjects": [

                    {
                        "name": "ඉංග්‍රීසි සාහිත්‍ය රසාස්වාදය"
                    },
                    {
                        "name": "සිංහල සාහිත්‍ය රසාස්වාදය"
                    },
                    {
                        "name": "දෙමළ සාහිත්‍ය රසාස්වාදය"
                    },
                    {
                        "name": "අරාබි සාහිත්‍ය රසාස්වාදය"
                    }

                ]
            },
            {
                "name": "3 වන කාණ්ඩයේ විෂයයන්",
                "subjects": [

                    {
                        "name": "තොරතුරු හා සන්නිවේදන තාක්ෂණය"
                    },
                    {
                        "name": "කෘෂි හා ආහාර තාක්ෂණය"
                    },
                    {
                        "name": "ජලජ ජීව සම්පත් තාක්ෂණවේදය"
                    },
                    {
                        "name": "ශිල්ප කලා"
                    },
                    {
                        "name": "ගෘහ ආර්ථික විද්‍යාව"
                    },
                    {
                        "name": "සෞඛ්‍ය හා ශාරීරික අධ්‍යාපනය"
                    },
                    {
                        "name": "සන්නිවේදනය හා මාධ්‍ය අධ්‍යයනය"
                    },
                    {
                        "name": "නිර්මාණකරණය හා ඉදිකිරීම් තාක්ෂණවේදය"
                    },
                    {
                        "name": "නිර්මාණකරණය හා යාන්ත්‍රික තාක්ෂණවේදය"
                    },
                    {
                        "name": "නිර්මාණකරණය, විදුලිය හා ඉලෙක්ට්‍රොනික තාක්ෂණවේදය"
                    },
                    {
                        "name": "විද්‍යුත් ලේඛනය හා ලඝු ලේඛනය"
                    }
                ]
            },
        ]
    },        
    {
        "category": "උසස් පෙළ අංශය",
        "appoint": [

            {
                "name": "උසස් පෙළ විද්‍යා විෂයයන්",
                "subjects": [
                    {
                        "name": "භෞතික විද්‍යාව"
                    },
                    {
                        "name": "රසායන විද්‍යාව"
                    },
                    {
                        "name": "ව්‍යවහාරික ගණිතය"
                    }, {
                        "name": "ශුද්ධ ගණිතය	"
                    },
                    {
                        "name": "උද්භිද විද්‍යාව"
                    },
                    {
                        "name": "සත්ව විද්‍යාව"
                    }, {
                        "name": "ජීව විද්‍යාව"
                    },
                    {
                        "name": "සංයුක්ත ගණිතය"
                    },
                    {
                        "name": "උසස් ගණිතය"
                    },
                    {
                        "name": "සංඛ්‍යානය"
                    }
        
                ]
            },
            {
                "name": "උසස් පෙළ තාක්ෂණ විෂයයන්",
                "subjects": [
                    {
                        "name": "සිවිල් තාක්ෂණවේදය"
                    },
                    {
                        "name": "යාන්ත්‍රික තාක්ෂණවේදය"
                    },
                    {
                        "name": "විදුලි, ඉලෙක්ට්‍රොනික හා තොරතුරු තාක්ෂණවේදය"
                    },
                    {
                        "name": "ආහාර තාක්ෂණවේදය"
                    },
                    {
                        "name": "කෘෂි තාක්ෂණවේදය"
                    },
                    {
                        "name": "ජෛව සම්පත් තාක්ෂණවේදය"
                    },
                    {
                        "name": "තොරතුරු හා සන්නිවේදන තාක්ෂණය"
                    },
                    {
                        "name": "ඉංජිනේරු තාක්ෂණවේදය"
                    },
                    {
                        "name": "ජෛව පද්ධති තාක්ෂණවේදය"
                    },
                    {
                        "name": "තාක්ෂණවේදය සඳහා විද්‍යාව"
                    }
                ]
            },
            {
                "name": "උසස් පෙළ ආගම් හා ශිෂ්ටාචාර විෂයයන්",
                "subjects": [
                    {
                        "name": "බුද්ධ ධර්මය"
                    },
                    {
                        "name": "හින්දු ධර්මය"
                    },
                    {
                        "name": "ක්‍රිස්තියානි ධර්මය"
                    },
                    {
                        "name": "ඉස්ලාම්"
                    },
                    {
                        "name": "බෞද්ධ ශිෂ්ටාචාරය"
                    },
                    {
                        "name": "හින්දු ශිෂ්ටාචාරය"
                    },
                    {
                        "name": "ඉස්ලාම් ශිෂ්ටාචාරය"
                    },
                    {
                        "name": "ග්‍රික හා රෝම ශිෂ්ටාචාරය"
                    },
                    {
                        "name": "ක්‍රිස්තියානි ශිෂ්ටාචාරය"
                    }
        
                ]
            },
            {
                "name": "උසස් පෙළ සෞන්දර්යය අධ්‍යයන විෂයයන්",
                "subjects": [
                    {
                        "name": "චිත්‍ර කලාව"
                    },
                    {
                        "name": "නර්තනය(දේශිය)"
                    },
                    {
                        "name": "නර්තනය(භාරත)"
                    },
                    {
                        "name": "පෙර දිග සංගීතය"
                    },
                    {
                        "name": "කරණාට සංගීතය"
                    },
                    {
                        "name": "බටහිර සංගීතය"
                    },
                    {
                        "name": "නාට්‍ය හා රංග කලාව "
                    }
        
                ]
            },
            {
                "name": "උසස් පෙළ භාෂා විෂයයන්",
                "subjects": [
                    {
                        "name": "සිංහල"
                    },
                    {
                        "name": "දෙමළ"
                    },
                    {
                        "name": "ඉංග්‍රීසි"
                    },
                    {
                        "name": "පාලි"
                    },
                    {
                        "name": "සංස්කෘත"
                    },
                    {
                        "name": "අරාබි"
                    },
                    {
                        "name": "ප්‍රංශ"
                    },
                    {
                        "name": "ජර්මන්"
                    },
                    {
                        "name": "රුසියන්"
                    },
                    {
                        "name": "හින්දි"
                    },
                    {
                        "name": "කොරියන්"
                    },
                    {
                        "name": "චීන"
                    },
                    {
                        "name": "ජපන්"
                    }
        
                ]
            },
            {
                "name": "උසස් පෙළ අනෙකුත් කලා / වාණිජ විෂයයන්",
                "subjects": [
                    {
                        "name": "ආර්ථික විද්‍යාව"
                    },
                    {
                        "name": "භූගෝල විද්‍යාව"
                    },
                    {
                        "name": "දේශපාලන විද්‍යාව"
                    },
                    {
                        "name": "තර්ක ශාස්ත්‍රය හා විද්‍යාත්මක ක්‍රමය"
                    },
                    {
                        "name": "වානිජ්‍ය"
                    },
                    {
                        "name": "කළමනාකරණය"
                    },
                    {
                        "name": "සමාජ විද්‍යාව"
                    },
                    {
                        "name": "ගෘහ ආර්ථික විද්‍යාව"
                    },
                    {
                        "name": "සන්නිවේදනය හා මාධ්‍ය අධ්‍යයනය"
                    },
                    {
                        "name": "කලා පොදු"
                    },
                    {
                        "name": "ව්‍යාපාර සංඛ්‍යානය"
                    },
                    {
                        "name": "ව්‍යාපාර අධ්‍යයනය"
                    },
                    {
                        "name": "ගිණුම්කරණය"
                    },
                    {
                        "name": "ඉතිහාසය (ලංකා ඉතිහාසය සමඟ / ඉන්දීය නූතන ලෝක / යුරෝපා)"
                    }
                ]
            },
            {
                "name": "උසස් පෙළ වෙනත් විෂයයන්",
                "subjects": [
        
                    {
                        "name": "ගණිතය"
                    },
                    {
                        "name": "කෘෂි විද්‍යාව"
                    },
                    {
                        "name": "සාමාන්‍ය ඉංග්‍රීසි (General English)"
                    },
                    {
                        "name": "සාමාන්‍ය තොරතුරු තාක්ෂණය (GIT)"
                    },
                    {
                        "name": "වෘත්තීය අධ්‍යාපන විෂයයන්"
                    },
                    {
                        "name": "නිශ්චිත අංශයක් නොමැත"
                    },
                    {
                        "name": "උපදේශන හා මඟ පෙන්වීම"
                    },
                    {
                        "name": "පුස්තකාල හා තොරතුරු අධ්‍යයනය"
                    },
                    {
                        "name": "විශේෂ අධ්‍යාපනය"
                    }              
                ]
            }
        ]  
    }
]       

