export const appointed_subject_structure = [
    {
        "name": "1 - ප්‍රාථමික අංශය",
        "subjects": [
            {
                "name": "101 - ප්‍රාථමික පොදු"
            },
            {
                "name": "131 - ප්‍රාථමික ඉංග්‍රීසි"
            },
            {
                "name": "109 - ප්‍රාථමික සෞන්දර්යය"
            },
            {
                "name": "199 - ප්‍රාථමික වෙනත් විෂයයක්"
            }
        ]
    },
    {
        "name": "1 - ආගමික විෂයයන්",
        "subjects": [

            {
                "name": "211 - බුද්ධ ධර්මය"
            },
            {
                "name": "212 - හින්දු ධර්මය / ශෛවනාරි"
            },
            {
                "name": "214 - කතෝලික ධර්මය"
            },
            {
                "name": "215 - ක්‍රිස්තියානි ධර්මය"
            },
            {
                "name": "216 - ඉස්ලාම්"
            }
        ]
    },
    {
        "name": "2 - අනෙකුත් හර විෂයයන්",
        "subjects": [

            {
                "name": "221 - සිංහල භාෂාව හා සාහිත්‍යය"
            },
            {
                "name": "222 – දෙමළ භාෂාව හා සාහිත්‍යය"
            },
            {
                "name": "231 - ඉංග්‍රීසි භාෂාව"
            },
            {
                "name": "232 - ගණිතය"
            },
            {
                "name": "233 - ඉතිහාසය"
            },
            {
                "name": "234 - විද්‍යාව"
            },
            {
                "name": "239 - විද්‍යා / ගණිත"
            }
        ]
    },
    {
        "name": "3 - සෞන්දර්යය විෂයයන්",
        "subjects": [

            {
                "name": "240 - සංගීතය (පෙර දිග)"
            },
            {
                "name": "241 - සංගීතය (බටහිර)"
            },
            {
                "name": "242 - කරණාට සංගීතය"
            },
            {
                "name": "243 - චිත්‍ර"
            },
            {
                "name": "244 - නැටුම්(දේශීය)"
            },
            {
                "name": "245 - භාරත නැටුම්"
            },
            {
                "name": "250 - නාට්‍ය හා රංග කලාව"
            }
        ]
    },
    {
        "name": "4 - භාෂා විෂයයන්",
        "subjects": [

            {
                "name": "266 - පාලි"
            },
            {
                "name": "267 - සංස්කෘත"
            },
            {
                "name": "268 - ප්‍රංශ"
            },
            {
                "name": "269 - ජර්මන්"
            },
            {
                "name": "270  - හින්දි"
            },
            {
                "name": "271 - ජපන්"
            },
            {
                "name": "272 - අරාබි"
            },
            {
                "name": "273 - කොරියන්"
            },
            {
                "name": "274 - චීන"
            },
            {
                "name": "275 - රුසියන්"
            }
        ]
    },
    {
        "name": "5 - 1 වන කාණ්ඩයේ වෙනත් විෂයයන්",
        "subjects": [

            {
                "name": "227 - සමාජ විද්‍යාව"
            },
            {
                "name": "235 - ප්‍රායෝගික තාක්ෂණ කුසලතා (ප්‍රා.තා.කු)"
            },
            {
                "name": "236 - සමාජ අධ්‍යයනය"
            },
            {
                "name": "260 - ව්‍යාපාර හා ගිණුම්කරණ අධ්‍යයනය"
            },
            {
                "name": "261 - භූගෝල විද්‍යාව"
            },
            {
                "name": "262 - පුරවැසි අධ්‍යාපනය"
            },
            {
                "name": "263 - ව්‍යවසායකත්ව අධ්‍යයනය"
            },
            {
                "name": "264 - දෙවන භාෂාව (සිංහල)"
            },
            {
                "name": "265 - දෙවන භාෂාව (දෙමළ)"
            }
        ]
    },
    {
        "name": "1 - 2 වන කාණ්ඩයේ වෙනත් විෂයයන්",
        "subjects": [

            {
                "name": "246 - ඉංග්‍රීසි සාහිත්‍ය රසාස්වාදය"
            },
            {
                "name": "247 - සිංහල සාහිත්‍ය රසාස්වාදය"
            },
            {
                "name": "248 - දෙමළ සාහිත්‍ය රසාස්වාදය"
            },
            {
                "name": "249 - අරාබි සාහිත්‍ය රසාස්වාදය"
            }

        ]
    },
    {
        "name": "7 - 3 වන කාණ්ඩයේ විෂයයන්",
        "subjects": [

            {
                "name": "280 - තොරතුරු හා සන්නිවේදන තාක්ෂණය"
            },
            {
                "name": "281 - කෘෂි හා ආහාර තාක්ෂණය"
            },
            {
                "name": "282 - ජලජ ජීව සම්පත් තාක්ෂණවේදය"
            },
            {
                "name": "284 - ශිල්ප කලා"
            },
            {
                "name": "285 - ගෘහ ආර්ථික විද්‍යාව"
            },
            {
                "name": "286 - සෞඛ්‍ය හා ශාරීරික අධ්‍යාපනය"
            },
            {
                "name": "287 - සන්නිවේදනය හා මාධ්‍ය අධ්‍යයනය"
            },
            {
                "name": "288 - නිර්මාණකරණය හා ඉදිකිරීම් තාක්ෂණවේදය"
            },
            {
                "name": "289 - නිර්මාණකරණය හා යාන්ත්‍රික තාක්ෂණවේදය"
            },
            {
                "name": "290 - නිර්මාණකරණය, විදුලිය හා ඉලෙක්ට්‍රොනික තාක්ෂණවේදය"
            },
            {
                "name": "292 - විද්‍යුත් ලේඛනය හා ලඝු ලේඛනය"
            }
        ]
    },
    {
        "name": "8 - උසස් පෙළ විද්‍යා විෂයයන්",
        "subjects": [
            {
                "name": "301 - භෞතික විද්‍යාව"
            },
            {
                "name": "302 - රසායන විද්‍යාව"
            },
            {
                "name": "303 - ව්‍යවහාරික ගණිතය"
            }, {
                "name": "304 - ශුද්ධ ගණිතය	"
            },
            {
                "name": "305 - උද්භිද විද්‍යාව"
            },
            {
                "name": "306 - සත්ව විද්‍යාව"
            }, {
                "name": "309 - ජීව විද්‍යාව"
            },
            {
                "name": "310 - සංයුක්ත ගණිතය"
            },
            {
                "name": "311 - උසස් ගණිතය"
            },
            {
                "name": "312 - සංඛ්‍යානය"
            }

        ]
    },
    {
        "name": "9 - උසස් පෙළ තාක්ෂණ විෂයයන්",
        "subjects": [
            {
                "name": "314 - සිවිල් තාක්ෂණවේදය"
            },
            {
                "name": "315 - යාන්ත්‍රික තාක්ෂණවේදය"
            },
            {
                "name": "316 - විදුලි, ඉලෙක්ට්‍රොනික හා තොරතුරු තාක්ෂණවේදය"
            },
            {
                "name": "317 - ආහාර තාක්ෂණවේදය"
            },
            {
                "name": "318 - කෘෂි තාක්ෂණවේදය"
            },
            {
                "name": "319 - ජෛව සම්පත් තාක්ෂණවේදය"
            },
            {
                "name": "320 - තොරතුරු හා සන්නිවේදන තාක්ෂණය"
            },
            {
                "name": "365 - ඉංජිනේරු තාක්ෂණවේදය"
            },
            {
                "name": "366 - ජෛව පද්ධති තාක්ෂණවේදය"
            },
            {
                "name": "367 - තාක්ෂණවේදය සඳහා විද්‍යාව"
            }
        ]
    },
    {
        "name": "10 - උසස් පෙළ ආගම් හා ශිෂ්ටාචාර විෂයයන්",
        "subjects": [
            {
                "name": "341 - බුද්ධ ධර්මය"
            },
            {
                "name": "342 - හින්දු ධර්මය"
            },
            {
                "name": "343 - ක්‍රිස්තියානි ධර්මය"
            },
            {
                "name": "344 - ඉස්ලාම්"
            },
            {
                "name": "345 - බෞද්ධ ශිෂ්ටාචාරය"
            },
            {
                "name": "346 - හින්දු ශිෂ්ටාචාරය"
            },
            {
                "name": "347 - ඉස්ලාම් ශිෂ්ටාචාරය"
            },
            {
                "name": "348 - ග්‍රික හා රෝම ශිෂ්ටාචාරය"
            },
            {
                "name": "349 - ක්‍රිස්තියානි ශිෂ්ටාචාරය"
            }

        ]
    },
    {
        "name": "11 - උසස් පෙළ සෞන්දර්යය අධ්‍යයන විෂයයන්",
        "subjects": [
            {
                "name": "351 - චිත්‍ර කලාව"
            },
            {
                "name": "352 - නර්තනය(දේශිය)"
            },
            {
                "name": "353 - නර්තනය(භාරත)"
            },
            {
                "name": "354 - පෙර දිග සංගීතය"
            },
            {
                "name": "355 - කරණාට සංගීතය"
            },
            {
                "name": "356 - බටහිර සංගීතය"
            },
            {
                "name": "357 - නාට්‍ය හා රංග කලාව "
            }

        ]
    },
    {
        "name": "12 - උසස් පෙළ භාෂා විෂයයන්",
        "subjects": [
            {
                "name": "371 - සිංහල"
            },
            {
                "name": "372 - දෙමළ"
            },
            {
                "name": "373 - ඉංග්‍රීසි"
            },
            {
                "name": "374 - පාලි"
            },
            {
                "name": "375 - සංස්කෘත"
            },
            {
                "name": "378 - අරාබි"
            },
            {
                "name": "381 - ප්‍රංශ"
            },
            {
                "name": "382 - ජර්මන්"
            },
            {
                "name": "383 - රුසියන්"
            },
            {
                "name": "384 - හින්දි"
            },
            {
                "name": "385 - කොරියන්"
            },
            {
                "name": "386 - චීන"
            },
            {
                "name": "387 - ජපන්"
            }

        ]
    },
    {
        "name": "13 - උසස් පෙළ අනෙකුත් කලා / වාණිජ විෂයයන්",
        "subjects": [
            {
                "name": "321 - ආර්ථික විද්‍යාව"
            },
            {
                "name": "322 - භූගෝල විද්‍යාව"
            },
            {
                "name": "323 - දේශපාලන විද්‍යාව"
            },
            {
                "name": "324 - තර්ක ශාස්ත්‍රය හා විද්‍යාත්මක ක්‍රමය"
            },
            {
                "name": "325 - වානිජ්‍ය"
            },
            {
                "name": "326 - කළමනාකරණය"
            },
            {
                "name": "327 - සමාජ විද්‍යාව"
            },
            {
                "name": "328 - ගෘහ ආර්ථික විද්‍යාව"
            },
            {
                "name": "329 - සන්නිවේදනය හා මාධ්‍ය අධ්‍යයනය"
            },
            {
                "name": "330 - කලා පොදු"
            },
            {
                "name": "331 - ව්‍යාපාර සංඛ්‍යානය"
            },
            {
                "name": "332 - ව්‍යාපාර අධ්‍යයනය"
            },
            {
                "name": "333 - ගිණුම්කරණය"
            },
            {
                "name": "396 - ඉතිහාසය (ලංකා ඉතිහාසය සමඟ / ඉන්දීය නූතන ලෝක / යුරෝපා)"
            }
        ]
    },
    {
        "name": "14 - උසස් පෙළ වෙනත් විෂයයන්",
        "subjects": [

            {
                "name": "307 - ගණිතය"
            },
            {
                "name": "308 - කෘෂි විද්‍යාව"
            },
            {
                "name": "313 - සාමාන්‍ය ඉංග්‍රීසි (General English)"
            },
            {
                "name": "392 - සාමාන්‍ය තොරතුරු තාක්ෂණය (GIT)"
            },
            {
                "name": "395 - වෘත්තීය අධ්‍යාපන විෂයයන්"
            },
            {
                "name": "400 - නිශ්චිත අංශයක් නොමැත"
            },
            {
                "name": "401 - උපදේශන හා මඟ පෙන්වීම"
            },
            {
                "name": "402 - පුස්තකාල හා තොරතුරු අධ්‍යයනය"
            },
            {
                "name": "493 - විශේෂ අධ්‍යාපනය"
            }



        ]
    }
    
    

]