
export function truncate(source: string, size: number) {
  return source.length > size ? source.slice(0, size - 1) + "…" : source;
}

export function isEmpty(d: any) {
  if (!d) return true;

  if (typeof d == 'object' && Object.keys(d).length == 0) {
    return true
  }

  return false;
}

export const nirathawenaKaaryaya = [
  'සාමාන්‍ය පන්ති වල ඉගැන්වීමේ කටයුතු',
  'විදුහලේ පරිපාලන හා කළමනාකරණ කටයුතු',
  'උසස් පෙළ (12-13 ශ්‍රේණි) අධීක්ෂණ කටයුතු',
  'උසස් පෙළ (විද්‍යා අංශය) අධීක්ෂණ කටයුතු',
  'උසස් පෙළ (තක්ෂණ අංශය ) අධීක්ෂණ කටයුතු',
  'උසස් පෙළ (කලා/වාණිජ අංශය ) අධීක්ෂණ කටයුතු',
  'ද්විතීයික (6-11 ශ්‍රේණි) අධීක්ෂණ කටයුතු',
  'ප්‍රාථමික (1-5 ශ්‍රේණි) අධීක්ෂණ කටයුතු',
  'ගුරු උපදේශක කටයුතු',
  'ශිෂ්‍ය උපදේශන කටයුතු',
  'පුස්තකාල කටයුතු',
  'කාර්යාල කටයුතු',
  'විශේෂ අධ්‍යාපන ඒකකයේ කටයුතු', 
  'පාසලේ පරිගණක කටයුතු',
  'විද්‍යා කේෂ්ත්‍ර මධ්‍යස්ථාන කටයුතු',
  'ක්‍රීඩා කටයුතු',
  'විෂය සමගාමී කටයුතු',
  'වෙනත් රාජකාරි කටයුතු',
  'නිශ්චිත රාජකාරියක් පවරා නොමැත','',
  'වෙනත් පාසලකට තාවකාලිකව අනුයුක්ත ව සිටින',	
  'වෙනත් ආයතනයකට තාවකාලිකව අනුයුක්ත ව සිටින',
  'පාසලේ වැටුප් ලේඛනයට ඇතුළත් අධ්‍යයන නිවාඩු ලබා ඇති',
  'පාසලේ වැටුප් ලේඛනයට ඇතුළත් ප්‍රසූත නිවාඩු ලබා ඇති',
  'පාසලේ වැටුප් ලේඛනයට ඇතුළත් විශ්‍රාම පූර්ව නිවාඩු ලබා ඇති',
  'පාසලේ වැටුප් ලේඛනයට ඇතුළත් වෙනත් වැටුප් සහිත නිවාඩු ලබා ඇති',
  'පාසලේ වැටුප් ලේඛනයට ඇතුළත් වෙනත් වැටුප් රහිත නිවාඩු ලබා ඇති',
  'පාසලේ වැටුප් ලේඛනයට ඇතුළත් තාවකාලික වැඩ තහනම් වී ඇති'  
]

export const anshaya = [
  'භෞතික විද්‍යාව',
  'රසායන විද්‍යාව',
  'ව්‍යවහාර්ක ගණිතය',
  'ශුද්ධ ගණිතය',
  'උද්භිද විද්‍යාව',
  'සත්ව විද්‍යාව',
  'ගණිතය',
  'කෘෂි විද්‍යාව',
  'ජීව විද්‍යාව',
  'සංයුක්ත ගණිත‍ය',
  'උසස් ගණිතය',
  'සංඛ්‍යානය',
  'සාමාන්‍ය ඉංග්‍රීසි',
  'සිවිල් තාක්ෂණවේදය',
  'යාන්ත්‍රික තාක්ෂණවේදය',
  'විදුලි හා ඉලෙක්ට්‍රොනික හා',
  'තොරතුරු තාක්ෂණවේදය',
  'ආහාර තාක්ෂණවේදය',
  'කෘෂි තාක්ෂණවේදය',
  'ජෛව සම්පත් තාක්ෂණවේදය',
  'තොරතුරු හා සන්නිවේදන තාක්ෂණය',
  'ආර්ථික විද්‍යාව',
  'භූගෝල විද්‍යාව',
  'දේශපාලන විද්‍යාව',
  'තර්ක ශාස්ත්‍රය හා විද්‍යාත්මක ක්‍රමය',
  'වාණිජ්‍යය',
  'කළමනාකරණය',
  'සමාජ විද්‍යාව',
  'ගෘහ ආර්ථික විද්‍යාව',
  'සන්නිවේදනය හා මාධ්‍ය අධ්‍යයනය',
  'කලා පොදු',
  'ව්‍යාපාර සංඛ්‍යානය',
  'ව්‍යාපාර අධ්‍යයනය',
  'ගිණුම්කරණය',
  'බුද්ධ ධර්මය',
  'හින්දු ධර්මය',
  'ක්‍රිස්තියානි ධර්මය',
  'ඉස්ලාම්',
  'බෞද්ධ ශිෂ්ටාචාරය',
  'හින්දු ශිෂ්ටාචාරය',
  'ඉස්ලාම් ශිෂ්ටාචාරය',
  'ග්‍රික හා රෝම ශිෂ්ටාචාරය',
  'ක්‍රිස්තියානි ශිෂ්ටාචාරය',
  'චිත්‍ර කලාව',
  'නර්තනය(දේශිය)',
  'නර්තනය(භාරත)',
  'පෙරදිග සංගීතය',
  'කර්ණාටක සංගීතය',
  'බටහිර සංගීතය',
  'නාට්‍ය හා රංග කළාව',
  'ඉංජිනේරු තාක්ෂණවේදය',
  'ජෛව පද්ධති තාක්ෂණවේදය',
  'තාක්ෂණවේදය සඳහා විද්‍යාව',
  'සිංහල',
  'දෙමළ',
  'ඉංග්‍රීසි',
  'පාලි',
  'සංස්කෘත',
  'අරාබි',
  'ප්‍රංශ',
  'ජර්මන්',
  'රුසියන්',
  'හින්දි',
  'කොරියන්',
  'චීන',
  'ජපන්',
  'සාමාන්‍ය පොදු පරීක්ෂණය',
  'සාමාන්‍ය තොරතුරු තාක්ෂණය',
  'වෘත්තීය අධ්‍යාපන විෂයයන',
  'ඉතිහාසය(ලංකා ඉතිහාසය සමග ඉන්දීය/යුරෝපා/නූතන ලෝක)'
]

