export const education_level_structure = [
    {
        "name": "අධ්‍යපනය පිළිබඳ දර්ශනශූරී උපාධිය/ආචාර්ය උපාධිය (PhD Ed)",
        "categories": [] // Hide next
    },
    {
        "name": "අධ්‍යපනය පිළිබඳ දර්ශනපති උපාධිය (MPhil Ed)",
        "categories": []// Hide next
    },
    {
        "name": "පශ්චාත් උපාධිය",
        "categories": [
            {
                "name": "අධ්‍යාපනපති උපාධිය (MEd - General)"
            },
            {
                "name": "අධ්‍යාපන කළමනාකරණය පිළිබඳ අධ්‍යාපනපති උපාධිය (MEd – Educational Management)"
            },
            {
                "name": "අධ්‍යාපනපති උපාධිය (MEd - Teaching English for the Speakers of Other Languages) "
            },
            {
                "name": "අධ්‍යාපනපති උපාධිය (MEd Development Psychology / සංවර්ධන මනෝ විද්‍යාව පිළිබඳ)"
            },
            {
                "name": "අධ්‍යාපනපති උපාධිය  (MEd Science Education /  විද්‍යා අධ්‍යාපනය පිළිබඳ)"
            },
            {
                "name": "අධ්‍යාපනය පිළිබඳ ශාස්ත්‍රපති උපාධිය (MA in Ed)"
            },
            {
                "name": "ගුරු අධ්‍යාපනය පිළිබඳ ශාස්ත්‍රපති උපාධිය"
            },
            {
                "name": "ගුරු පුස්තකාලාධිපති විද්‍යාපති උපාධිය"
            },
            {
                "name": "අධ්‍යාපනය පිළිබඳ වෙනත් පශ්චාත් උපාධියක්"
            }      
        ]
    },
    {
        "name": "පශ්චාත් උපාධි ඩිප්ලෝමාව",
        "categories": [
            {
                "name": "පශ්චාත් උපාධි අධ්‍යාපන ඩිප්ලෝමාව (PG.Dip)"
            },
            {
                "name": "දෙවන භාෂාවක් ලෙස ඉංග්‍රීසි ඉගැන්වීම පිළිබඳ පශ්චාත් උපාධි අධ්‍යාපන ඩිප්ලෝමාව"
            },
            {
                "name": "පශ්චාත් උපාධි ඩිප්ලෝමාව (ශාරීරික අධ්‍යාපනය)"
            },
            {
                "name": "නාට්‍ය හා රංග කලාව පිළිබඳ පශ්චාත් උපාධි අධ්‍යාපන ඩිප්ලෝමාව"
            },
            {
                "name": "උපදේශනය පිළිබඳ පශ්චාත් උපාධි ඩිප්ලෝමාව"
            },
            {
                "name": "ගුරු පුස්තකාල විද්‍යා පශ්චාත් උපාධි ඩිප්ලෝමාව"
            },
            {
                "name": "වෙනත් පශ්චාත් උපාධි ඩිප්ලෝමාවක්"
            } 
        ]
    },
    {
        "name": "අධ්‍යපනවේදී උපාධිය",
        "categories": []
    },
    {
        "name": "ඩිප්ලෝමාව",
        "categories": [
            {
                "name": "ජාතික ශික්ෂණ විද්‍යා ඩිප්ලෝමාව"
            },
            {
                "name": "දෙවන භාෂාවක් ලෙස ඉංග්‍රීසි ඉගැන්වීම පිළිබඳ ඩිප්ලෝමාව"
            },
            {
                "name": "කෘෂි අධ්‍යාපනය පිළිබඳ ඩිප්ලෝමාව	"
            },
            {
                "name": "තාක්ෂණ ඩිප්ලෝමාව"
            },
            {
                "name": "උසස් තාක්ෂණ ඩිප්ලෝමාව"
            },
            {
                "name": "ගුරු පුස්තකාලාධිපති ඩිප්ලෝමාව"
            },
            {
                "name": "අධ්‍යාපන කේෂ්ත්‍රයට අදාළ වෙනත් ඩිප්ලෝමාවක්"
            },
        ]
    },
    {
        "name": "ගුරු පුහුණු සහතික පත්‍රය",
        "categories": [
            {
                "name": "ගුරු පුහුණු සහතිකය (ආයතනික)"
            },
            {
                "name": "ගුරු පුහුණු සහතිකය (දුරස්ථ)"
            },
            {
                "name": "ගුරු පුස්තකාලාධිපති සහතිකය"
            },
            {
                "name": "ප්‍රාථමික අධ්‍යාපනය පිළිබඳ පැය 300ක පුහුණු සහතිකය "
            },
            {
                "name": "අධ්‍යාපන කේෂ්ත්‍රයට අදාළ වෙනත් සහතිකයක්"
            },
        ]
    },
    {
        "name": "වෘත්තීය සුදුසුකමක් හදාරමින් සිටී",
        "categories": []
    },
    {
        "name": "වෘත්තීය සුදුසුකමක් ලබා නොමැත",
        "categories": []
    }

]
