export const service_structure = [
    {
        "name": " ශ්‍රී ලංකා අධ්‍යාපන පරිපාලන සේවය",
        "classes": [
            {
                "name": "I ශ්‍රේණිය"
            },
            {
                "name": "II ශ්‍රේණිය"
            },
            {
                "name": "III ශ්‍රේණිය"
            }
        ]
    },
    {
        "name": "ශ්‍රී ලංකා විදුහල්පති සේවය",
        "classes": [
            {
                "name": "1 පන්තිය"
            },
            {
                "name": "2 පන්තිය"
            },
            {
                "name": "3 පන්තිය"
            }
        ]
    },
    {
        "name": "ගූරු උපදේශක සේවය",
        "classes": [
            {
                "name": "1 පන්තිය"
            },
            {
                "name": "2 පන්තිය"
            },
            {
                "name": "3 පන්තිය"
            }
        ]
    },
    {
        "name": "ශ්‍රී ලංකා ගුරු සේවය",
        "classes": [
            {
                "name": "1 පන්තිය"
            },
            {
                "name": "2-I ශ්‍රේණිය"
            },
            {
                "name": "2-II ශ්‍රේණිය"
            },
            {
                "name": "3-I (අ) ශ්‍රේණිය"
            },
            {
                "name": "3-I (ආ) ශ්‍රේණිය"
            },
            {
                "name": "3-I (ඇ) ශ්‍රේණිය"
            },           
            {
                "name": "3-II ශ්‍රේණිය"
            }           
        ]
    },    
    {
        "name": "ශ්‍රී ලංකා ගුරු සේවයට අන්තර්ග්‍රහණය නොකළ/අයත් නොවන වෙනත් ගුරුවරු/ගුරු සහායකයින්/ස්වේච්ඡා ගුරුවරු",
        "classes": [
            {
                "name": "අදාළ නොවේ"
            }
            
        ]
    }

]